{"intents": [
        {"tag": "greeting",
         "patterns": ["Hi there", "How are you", "Is anyone there?","Hey","Hola", "Hello", "Good day"],
         "responses": ["Hello, thanks for asking", "Good to see you again", "Hi there, how can I help?"],
         "context": [""]
        },
        {"tag": "goodbye",
         "patterns": ["Bye", "See you later", "Goodbye", "Nice chatting to you, bye", "Till next time"],
         "responses": ["See you!", "Have a nice day", "Bye! Come back again soon."],
         "context": [""]
        },
        {"tag": "thanks",
         "patterns": ["Thanks", "Thank you", "That's helpful", "Awesome, thanks", "Thanks for helping me"],
         "responses": ["Happy to help!", "Any time!", "My pleasure"],
         "context": [""]
        },
        {"tag": "noanswer",
         "patterns": [],
         "responses": ["Sorry, can't understand you", "Please give me more info", "Not sure I understand"],
         "context": [""]
        },
        {"tag": "options",
         "patterns": ["How you could help me?", "What you can do?", "What help you provide?", "How you can be helpful?", "What support is offered"],
         "responses": ["I can give you information about Government Engineering College, Bikaner. I can enlighten you about facilities and faculties of all departments in our college." ],
         "context": [""]
        },
        {"tag": "departments",
         "patterns": ["How many departments are there in college", "what departments are there", "Give me a list of departments", "which branches are there in college?","which courses are provided by college"],
         "responses": ["For Engineering we have Civil Engineering, Computer Science & Engineering, Electrical Engineering, Electronics and Communication Engineering, Electronics and instrumentation Control Engineering, Mechanical Engineering and Information Technology. We also have courses of Bachelors and Masters in Computer Application. We also have an MBA department . "],
         "context": [""]
        },
        {"tag": "cse_department",
         "patterns": ["about computer science and engineering department", "about cs department", "tell me about computer science branch", "I want to know about cs department", "features of CSE departent" ,"facilities in cs branch"],
         "responses": ["The Department of Computer Science & Engineering was established in the year 1999.Department of Computer Science & Engineering at the Engineering College Bikaner has been at the forefront of churning out software engineers with a high caliber of technicalexpertise. It continues to foster and engender the innovation and breadth of vision necessaryto excel in the blooming software industry. The department has always attracted the best ofengineering aspirants from all over. The department has a well qualified and experiencedfaculty members. The Department offers B. Tech., M. Tech. And Ph.D. course. Various labs in CSE department are Operating Systems lab, Network System lab, Computer Graphics lab, Linux OS lab, Computer Hardware lab ,DBMS lab, Programming lab and a separate research scholars lab."],
         "context": [""]
        },
        {"tag": "ee_department",
         "patterns": ["tell me about electrical engineering department", "about ee branch", "about electrical department", "i want to know about electrical engineering branch", "features of ee department","facilities in electrical branch" ],
         "responses": ["On behalf of the entire Department of Electrical Engineering, Engineering College Bikaner, it gives me immense pleasure in welcoming you all to this department. The Department of Electrical Engineering, which has a fine blend of young and dynamic personalities as faculty, is involved in providing quality education. It has a broad based UG curriculum affiliated with Bikaner Technical University, Kota. The syllabus of the courses are continuously updated and the laboratories modernized to reflect the rapid changes in technology. The Department has strong Industry interaction and has been involved in development of state-of-art products for Industry. It has testing facilities for carrying out industry sponsored research and consultancy projects. The Electrical Engineering Department at Engineering College Bikaner is one of the best of its kind in the Rajasthan. In its domain of heavy-current Electrical Engineering, the faculty and the facilities of the department are enviable.Various labs in the department are Power System lab, Electrical Machine lab, Power Electronics and Electric lab, Electrical Measurements and Instrumentation lab and a Control System lab."],
         "context": [""]
        },
        {"tag": "eice_department",
         "patterns": ["tell me about electronics and instrumentation control engineering department", "about eice branch", "about instrumentation control department", "i want to know about eic engineering department", "features of eice branch","facilities is eice branch"],
         "responses": ["The Department came into existence in 2003-04 to offer undergraduate course in Electronic Instrumentation & Control Engineering. envisaging the upcoming trends in Automation of Industries. The Department has young, dynamic and motivated faculty and state of the art facilities. The faculty provides expertise in various fields of Electrical & Mechanical Measurement, Calibration, Control Systems, Electronics, Computers, Process Instrumentation, Bio-Medical Instrumentation, Microprocessors, Microcontrollers etc. areas. The Department has well equipped labs and various laboratories are under the development in the fields of Process Instrumentation, Analytical Instrumentation Laboratories with the recent trends of Technology such as PLCs and SCADA with Computer Control, Distributed Process Control and Field Bus technology."],
         "context": [""]
        },
        {"tag": "me_department",
         "patterns": ["tell me about mechanical engineering department", "about me branch", "about mechanical department", "i want to know about mechanical engineering department", "features of mechanical branch","facilities in ME branch"],
         "responses": ["The Mechanical Engineering department is considered as the heart of the institute. The strength of the department is the highly qualified faculty which guides the students during the program. The Department has always strived for excellence and receives grants to modernise its laboratories. The department conducts active research and had several breakthroughs. It also provides services to local industries. Every year, students undergo in-plant training and industry sponsored projects. The students, with their innovative ideas presents technical papers at National level Symposiums and is successful in whatever fields they selected. Various labs in the department are Machine lab, Foundary lab, Computer lab, Carpentry lab Thermal lab, Fitting workshop and Welding workshop"],
         "context": [""]
        },
        {"tag": "it_department",
         "patterns": ["tell me about information technology department", "about IT branch", "about information technology department", "i want to know about it engineering department", "features of IT branch","facilities in IT branch"],
         "responses": ["The department of Information Technology was established in the year 2002. Since inception, it is consistently creating its place not only within the institute but also among its counterparts in the country and abroad.Bright students from all parts of the country take admissions for quality education in Information Technology department at undergraduate level. It continues to foster and engender the innovation and breadth of vision necessary to excel in the blooming software industry. The department has highly qualified and competent faculty members and adequate facilities for teaching and learning activity. Various labs in IT department are Operating Systems lab, Network System lab, Computer Graphics lab, Linux OS lab, Computer Hardware lab ,DBMS lab, Programming lab and a separate research scholars lab."],
         "context": [""]
        },
        {"tag": "ece_department",
         "patterns": ["tell me about ece department", "about electronics & communication branch", "about electronics and communication department", "i want to know about electrinics engineering branch", "features of ece department","facilities in ece branch" ],
         "responses": ["The Electronics & Communication Engineering department has been established in the year 1999. The department offers B. Tech. (ECE)course with intake of 90 seats. The strength of the department is theexcellent laboratory facilities and highly qualified faculty which guides the students during the program. Various labs in the department are Analog Electronics lab, Communication System lab, Computer lab, Computer Vision lab, Digital Electronics lab, VLSI design lab, Embeded System lab, RF and Antenna lab, Microwave and OFC lab, Networking and Wireless Communication lab, and Electronics workshop."],
         "context": [""]
        },
        {"tag": "civil_department",
         "patterns": ["tell me about ce department", "about civil engineering branch", "about civil department", "i want to know about civil department", "features of ce branch","facilities of civil branch"],
         "responses": ["One of the primary engineering departments of Govt Engineering College Bikaner, The department of civil engineering offers B.Tech. program. The department was established in 2013. The department has a separate 2 storey building and the faculties believe in practical knowledge. There is a material Testing lab, a Surveying lab and a Structure Engineering lab in the department"],
         "context": [""]
        },
        {"tag": "mca_department",
         "patterns": ["tell me about mca department", "about Masters of Computer Application department", "about Bachelors of Computer Application department", "i want to know about bca department", "features of mca department"],
         "responses": ["Engineering College Bikaner, has understood the importance of infrastructure to industries such as IT and focused on IT oriented courses both at the under graduate and post Graduate level. Its focal point is to provide students qualitatively superior higher-end IT education keeping in view the changing Technology and Industry demand the in-house core department at ECB maintains interaction with Industry experts & academician. The students at ECB are increasingly proving their worth as shown by very impressive figures of their placements in the industry overall. They are able to co-related their career with digital economy Due to dynamic nature of Computer Industry; languages, packages, operating systems, networking principles, software, hardware etc. are always changing, and keeping this in mind efforts are being made to teach the students at least one new technology (not prescribed in their course) every semester. In its quest to provide the students with best facilities to grow and develop themselves, the college in spite of its 400+ computers with round the clock high speed internet connectivity."],
         "context": [""]
        },
        {"tag": "mba_department",
         "patterns": ["tell me about mba department", "about Masters of Business Administration department", "about Bachelors of Business Administration department", "i want to know about BBA department", "features of MBA department", "Management Departent", "Department of management"],
         "responses": ["Department of Management & Technology, Engineering College, Bikaner, established in 2003,is an amalgamation of competent teachers, state of art infrastructure, pollution free environment an idyllic setting and an experienced and efficient administration. The institution came into existence with a vision of creating a supportive environment for its student-to provide a perfect balance of academics, sports and social opportunities. It aims to contribute significantly to education, training, consulting. Quality is a threshold limit and a qualifier .in itself, it is no longer a competitive advantage. what, then, can save us? Not all the mantras of globalization. Not the most Strategic of restructuring exercise. Not diversification. The truth, simply, is that India needs a quality revolution. A sudden and cataclysmic explosion of quality, extending across industries, across departments and functions, across business and across management education. One of the most important reason why corporate the world over the adopting quality practices furiously is the changing demand of the global customers. In our quest of establishing department of management & technology with international reckoning. We will have to accord a high priority to research activities, case studies and working papers. Besides we will have to also do collaborative research with scholars of other reputed institutions and collaborative conferences/seminars with other reputed institutions."],
         "context": [""]
        },
        {"tag": "mca_department",
         "patterns": ["tell me about BSc department", "about MSc department", "about department of applied Physics", "i want to know about department of applied mathematics", "features of department of applied Chemistry"],
         "responses": ["Applied science is a bridge that connects pure, basic science like physics or chemistry with engineering practices. Faculty and students in applied science employ fundamental physical and chemical principles to create innovative new technologies. These novel solutions are then handed off to engineering disciplines to be refined, enhanced and used to address important societal problems.Applied Mathematics offers courses to undergraduate students of various engineering disciplines. The syllabus have been designed in the areas of applied mathematics, computational techniques and statistical testing to impart the sound knowledge of the various mathematical tools used and their applications in the engineering disciplines. Post graduate course M.Sc. Mathematics is also running in the department from last 4 years. The department having 5 regular faculty members out of which 4 are Ph.D. from Govt. University. Total 79 research papers are published in various internation/National journals/Conferences and 6 books are published at department level.P.G. course M.Sc. Mathematics is running in the department since 2013.Students are regularly involved in N.C.C. , N.S.S, S.A.C, I.S.T.E and participated in many Tech. Feasts and cultural activities.Department of applied Science is a bridge that connects pure, basic science like physics or chemistry with engineering practices. Faculty and students in applied science employ fundamental physical and chemical principles to create innovative new technologies. These novel solutions are then handed off to engineering disciplines to be refined, enhanced and used to address important societal problems.Applied Mathematics offers courses to undergraduate students of various engineering disciplines. The syllabus have been designed in the areas of applied mathematics, computational techniques and statistical testing to impart the sound knowledge of the various mathematical tools used and their applications in the engineering disciplines. Post graduate course M.Sc. Mathematics is also running in the department from last 4 years. The department having 5 regular faculty members out of which 4 are Ph.D. from Govt. University. Total 79 research papers are published in various internation/National journals/Conferences and 6 books are published at department level.Students are regularly involved in N.C.C. , N.S.S, S.A.C, I.S.T.E and participated in many Tech. Feasts and cultural activities."],
         "context": [""]
        },
        {"tag": "placements",
         "patterns": ["how are placements in college", "who are the major recruiters that hire from college?", "how is placement status of the college", "does college help in aquiring placement", "do companies come to college?"],
         "responses": ["The college provides 100 percent placement assistance. Companies regularly visiting campus include Vedanta , Cairn Energy, Sunarc Technologies, Ranosys, Arunaya Insurance, etc.The college also provides training for job interviews. "],
         "context": [""]
        },
        {"tag": "cse_faculty",
         "patterns": ["Give me information about faculty of cse department","about faculty of Computer Science and engineering department","enlighten me about faculty of computer Science branch","how are teachers of CSE department"],
         "responses": ["1) Mr. Maninder Nehra (Designation: HOD, Assistant Professor, Qualification: Ph.D. (MNIT, Jaipur))   2) Mr. Ranu Lal Chouhan (Designation: Assistant Professor, Qualification: M.E.(NITTTR, Chandigarh))   3) Dr. N.S. Shekhawat (Designation: Assistant Professor, Qualification: Ph.D., MS (BITS Pilani))   4) Dr. Abhishek Singh Kilak (Designation: Assistant Professor, Qualification: Ph.D.*(MNIT, Jaipur))   5) Mr. RiturajSoni (Designation: Assistant Professor, Qualification: Ph.D.* (NSIT, Delhi))   6) Mr. Vinod Choudhary (Designation: Assistant Professor, Qualification: M.E.(NITTTR Chandigarh))   7) Mr. Pratap Singh Barth (Designation: Assistant Professor, Qualification: M.E.*(NITTTR Chandigarh))   8) Mr. Rishi Raj Vyas (Designation: Assistant Professor, Qualification: MTech.(Jadavpur Uni. Kolkata))   9) Ms. Vinita Gahlot (Designation: Assistant Professor, Qualification: MTech.)   10) Mr. Surendra Singh Choudhary (Designation: Assistant Professor, Qualification: MTech. (IIT Roorkee))   11) Mrs. Charu Jain (Designation: Assistant Professor, Qualification: Mtech. (RTU Kota))   12) Mr. Nawavarsha  Pipada (Designation: Assistant Professor (By NPUI), Qualification: MTech.)  "],
         "context":[""]
        },
        {"tag": "ece_faculty",
         "patterns": ["Give me information about faculty of ece department","about faculty of electronics and communication engineering department","enlighten me about faculty of electronics branch","how are teachers of ec department"],
         "responses": ["1) Dr. Manoj Kuri (Designation: HOD, Assistant Professor, Qualification: Ph.D. (IIT Roorkee), MTech.)   2) Dr. Abhishek Acharya (Designation: Assistant Professor, Qualification: Ph.D. (IIT Roorkee), M.E.)   3) Dr. S.K. Bishnoi (Designation: Asociate Professor, Qualification: Ph.D.(MNIT Jaipur), M.E.)   4) Dr. Sanjeev Jain (Designation: Associate Professor, Qualification: Ph.D.(MNNIT Allahabad), M.E.)   5) Mr. G.P. Sinsinwar (Designation: Associate Professor, Qualification: Ph.D.*(GJU Hissar), M.E.)   6) Mrs. InduBhuria (Designation: Assistant Professor, Qualification: Ph.D.*(MNIT Jaipur))   7) Dr. Sandeep Rankawat (Designation: Assistant Professor, Qualification: Ph.D., MTech.(MNIT Jaipur))   8) Mr. Chena Ram (Designation: Assistant Professor, Qualification: Ph.D.*, M.E.(NITTTR Chandigarh))   9) Mr. Rajendra Singh Shekhawat (Designation: Assistant Professor, Qualification: MTech.(MNNIT Allahabad))   10) Mr. Ravi Kumar (Designation: Assistant Professor(TEQUIP-III), Qualification: MTech.(IIT BHU Varanasi))   11) Ms. D. Sri Kanya (Designation: Assistant Professor(TEQUIP-III), Qualification: Ph.D.*(MNIT Jaipur), MTech.)   "],
         "context":[""]
        },
        {"tag": "ee_faculty",
         "patterns": ["Give me information about faculty of EE department","about faculty of electrical engineering department","enlighten me about faculty of electrical department department","how are teachers of ee branch"],
         "responses": ["1) Dr.Ujjawal K. Kalla (Designation: HOD, Assistant Professor, Qualification: Ph.D. & MTech. (IIT Delhi))   2) Mr. Surendra Singh Tanwar (Designation: Assistant Professor, Qualification: Ph.D.* & MTech. (IIT Roorkee))   3) Dr. Vikas Sharma (Designation: Assistant Professor, Qualification: Ph.D. (MNNIT, Allahabad), M.E. (NITTTR))   4) Dr.MahendraBhadu (Designation: Assistant Professor, Qualification: Ph.D.(IIT Delhi), MTech.(MNIT))   5) Mr. Manish Tater (Designation: Assistant Professor, Qualification: M.E. (NITTTR))   6) Mr. Manoj Chhimpa (Designation: Assistant Professor, Qualification: M.E.(NITTTR))   7) Dr. Ganesh Prasad (Designation: Assistant Professor, Qualification: Ph.D.(IIT Delhi), M.E.(NITTTR))   8) Mrs. Rekha Swami (Designation: Assistant Professor, Qualification: MTech.(IIT Roorkee))   9) Mr. Naveen Paliwal (Designation: Assistant Professor, Qualification: Ph.D.*(MNNIT Allahabad), M.E.(BIT Mesra))   10) Mr. Subhash Kumar (Designation: Assistant Professor, Qualification: ME)   12) Mr. Vinod Kumar Yadav (Designation: Assistant Professor, Qualification: Ph.D.*(MNIT Jaipur), MTech.)   13) Ms. Shivani Garg (Designation: Assistant Professor, Qualification: Ph.D.*, MTech)   "],
         "context":[""]
        },
        {"tag": "me_faculty",
         "patterns": ["Give me information about faculty of ME department","about faculty of mechanical engineering branch","enlighten me about faculty of mechanical department","how are teachers of me department"],
         "responses": ["1) Dr. C.S. Rajoria (Designation: HOD, Assistant Professor, Qualification: Ph.D. (IIT Delhi), M.E.)   2) Dr. Jaiprakash Bhamu (Designation: Principal, Associate Professor, Qualification: Ph.D.(BITS Pilani), MTech.(MNIT Jaipur))   3) Dr. Sanjay Singh Rathore (Designation: Assistant Professor, Qualification: Ph.D.(IIT Roorkee), M.E.)   4) Dr.OmPrakashJhakhar (Designation: Associate Professor, Qualification: Ph.D.(MPAUT, Udaipur), M.E.)   5) Dr. Pankaj Gupta (Designation: Assistant Professor, Qualification: Ph.D.(IIT Roorkee), M.E.)   6) Dr. Arun Kumar Purohit (Designation: Assistant Professor, Qualification: Ph.D.(IIT Delhi), MS(BITS Pilani))   7) Mr. Mohd. Yunus Sheikh (Designation: Assistant Professor, Qualification: Ph.D.*, MTech. (IIT Delhi))   8) Mr. Vineet Kumar (Designation: Assistant Professor, Qualification: Ph.D.*(IIT Roorkee), MTech.(MNNIT Allahabad))   9) Mr. Ranjeet S. Rathore (Designation: Assistant Professor, Qualification: Ph.D.*(IIT Roorkee), M.E.(NITTTR Chandigarh))   10) Mr. Dharmendra Singh (Designation: Assistant Professor, Qualification: Ph.D.(IIT Roorkee), M.E.)   11) Mr. S.S. Suthar (Designation: Assistant Professor, Qualification: M.E.)   12) Dr. Ravi Kumar (Designation: Assistant Professor(TEQUIP-III), Qualification: Ph.D.(IIT Roorkee), MTech(IIT Roorkee))   13) Mr. Rahul Saraswat (Designation: Assistant Professor(TEQUIP-III), Qualification: MTech.(IIT BHU Varanasi))   14) Mr. Vikas Tiwari (Designation: Assistant Professor(TEQUIP-III), Qualification: MTech.(IIT BHU Varanasi))   15) Mr. Shiv Shankar Laxman Tale (Designation: Assistant Professor(TEQUI-III), Qualification: MTech.(VNIT Nagpur))   16) Mr. Khushal (Designation: Assistant Professor(TEQUIP-III), Qualification: MTech.(IIT Kanpur))   17) Mr. B. Meghshyam Raju (Designation: Assistant Professor(TEQUIP-III), Qualification: MTech.(NIT Surathkal))   18) Mr. Sandeep Gupta (Designation: Assistant Professor(TEQUIP-III), Qualification: MTech.(IIT Roorkee))   19) Mr. Abhishek Pratap Singh (Designation: Assistant Professor(TEQUIP-III), Qualification: MTech.(IIT Madras))   "],
         "context":[""]
        },
        {"tag": "ce_faculty",
         "patterns": ["Give me information about faculty of CE department","about faculty of Civil engineering department","enlighten me about faculty of civil branch","how are teachers of CE department"],
         "responses": ["1) Mr. Prashant Bhaker (Designation: HOD, Assistant Professor, Qualification: M.E.)   2) Mr. Nikhil Garg (Designation: Assistant Professor, Qualification: MTech. (BY NPUI))   3) Mr. Rohit Vyas (Designation: Assistant Professor(Contract Basis), Qualification: MTech.)   4) Mr. Ravinder Kumar (Designation: Assistant Professor(Contract Basis), Qualification: MTech.)   5) Mr. Manish Tiwari (Designation: Assistant Professor (Contract Basis), Qualification: MTech.)   6) Mr. Tanmay Shandilya (Designation: Assistant Professor (Contract Basis), Qualification: MTech.)   7) Mr. Anil Choudhary (Designation: Assistant Professor (Contract Basis), Qualification: MTech.)   8) Mr. Kailash Chand (Designation: Assistant Professor (Contract Basis), Qualification: MTech.)   9) Mr. Kartikaya Joshi (Designation: Assistant Professor (Contract Basis), Qualification: MTech.)   10) Mr. Amandeep (Designation: Assistant Professor (Contract Basis), Qualification: BTech.)   11) Ms. Shilpa Jangir (Designation: Assistant Professor (Contract Basis), Qualification: BTech.)  "],
         "context":[""]
        },
        {"tag": "eice_faculty",
         "patterns": ["Give me information about faculty of EICE department","about faculty of electronics and instrumentation control engineering department","enlighten me about faculty of instrumentation department","how are teachers of eice department"],
         "responses": ["1) Mr. Hamid Ali (Designation: HOD, Assistant Professor, Qualification: M.E(NITTTR Chandigarh))   2) Mr. Harjeet Singh (Designation: Assistant Professor, Qualification: Ph.D.*, MTech.(IIT Roorkee))   3) Dr. Rahul Raj Choudhary (Designation: Associate Professor, Qualification: Ph.D., M.E.)   4) Mr. RaviderDayama (Designation: Assistant Professor, Qualification: M.E.(NITTTR CHandigarh))   5) Dr.Jhumar Lal Beniwal (Designation: Assistant Professor, Qualification: Ph.D.(MNNIT, Allahabad), M.E.(NIT Agartalla))   6) Mrs. Pooja Bhardwaj (Designation: Assistant Professor, Qualification: MTech.(IIT Roorkee))   7) M. Jatindra Kumar Jain (Designation: Assistant Professor, Qualification: Ph.D.*(RTU Kota), M.E.(NITTTR Chandigarh))   8) Mr. Ravinder Panchariya (Designation: Assistant Professor, Qualification: M.E(NITTTR Chandigarh))   9) Mr. Arvind (Designation: Assistant Professor, Qualification: ME)  "],
         "context":[""]
        },
        {"tag": "it_faculty",
         "patterns": ["Give me information about faculty of IT department","about faculty of Information Technology department","enlighten me about faculty of IT branch","how are teachers of software department"],
         "responses": ["1) Mr. Deepak Singh (Designation: HOD, Assistant Professor, Qualification: Ph.D.*(IIT Roorkee), MTech.(IIT Roorkee))   2) Dr.Hardayal Singh Shekhawat (Designation: Associate Professor, Qualification: Ph.D., M.E.)   3) Mr. Raj Kumar Choudhary (Designation: Assistant Professor, Qualification: Ph.D.*(IIT Bombay), MTech. (RTU Kota))   4) Dr. Subhash Panwar (Designation: Assistant Professor, Qualification: Ph.D.(MNIT Jaipur), MTech.(MNNIT Allahabad))   5) Mr. Rahul Agarwal (Designation: Assistant Professor, Qualification: Ph.D.*(RT Kota), M.E.(Central Univ. Rajasthan))   6) Mr. Ajay Choudhary (Designation: Assistant Professor, Qualification: Ph.D.* &Mtech.(IIT Roorkee))   7) Mr. Vikram Singh Chouhan (Designation: Assistant Professor, Qualification: M.E.*(NITTTR Chandigarh))   8) Mrs. Anita Chandel (Designation: Assistant Professor, Qualification: MTech. (IISc. Bangalore))   9) Mr. Dhanroom Mal Nagar (Designation: Assistant Professor, Qualification: MTech.(NITTTR Chandigarh))   10) Ms. Poonam Sharma (Designation: Assistant Professor(Appointed by NPUI), Qualification: MTech.)   11) Mr. Prashant Kumar (Designation: Assistant Professor(Appointed by NPUI), Qualification: MTech.)   12) Mr. Dasari Raja Shekhar (Designation: Assistant Professor(Appointed by NPUI), Qualification: MTech.)  "],
         "context":[""]
        },
        {"tag": "mba_faculty",
         "patterns": ["Give me information about faculty of Management department","about faculty of MBA department","enlighten me about faculty of Masters of business administration department","how are teachers of Bachelor of business administration department", "faculty of BBA department"],
         "responses": ["1) Dr. Giriraj Kiradoo (Designation: HOD, Associate Professor, Qualification: PhD, MBA)   2) Dr. Richa Yadav (Designation: Assistant Professor, Qualification: )   3) Dr. Surendra Kumar Vyas (Designation: Professor, Qualification: PhD, MBA)   4) Dr. Gaurav Bissa (Designation: Associate Professor, Qualification: PhD, MBA)   5) Dr. Vijay Sharma (Designation: Assistant Professor, Qualification: PhD, MBA)   6) Mrs. Rakhi Pareek (Designation: Assistant Professor, Qualification: MBA)   7) Dr. Vijay Mohan Vyas (Designation: Assistant Professor, Qualification: PhD, MBA, MCM)   8) Mr. Virendra Choudhary (Designation: Assistant Professor, Qualification: PhD*, MBA)   9) Dr. Avdhesh Vyas (Designation: Assistant Professor, Qualification: PhD, MBA)   10) Dr. Naveen Sharma (Designation: Assistant Professor, Qualification: PhD, MBA)  "],
         "context":[""]
        },
        {"tag": "mca_faculty",
         "patterns": ["Give me information about faculty of MCA department","about faculty of Masters of computer application department","enlighten me about faculty of Bachelors of computer application department","how are teachers of BCA department"],
         "responses": ["1) Dr. Devendra Gahlot (Designation: HOD, Assistant Professor, Qualification: )   2) Dr. Rakesh Poonia (Designation: Assistant Professor, Qualification: Ph.D., MCA)   3) Mr. Ganesh Singh (Designation: Assistant Professor, Qualification: MCA, MTech.)   4) Dr. Ankur Goswami (Designation: Assistant Professor, Qualification: Ph.D., MCA, MTech.)   5) Mr. Kunal Bhushan Ranga (Designation: Assistant Professor, Qualification: MTech., B.E.)   6) Dr. Sanjay Tejasvee (Designation: Assistant Professor, Qualification: Ph.D.(CS), MCA, UGC NET Qualified)   7) Dr. Vishal Gaur (Designation: Assistant Professor, Qualification: Ph.D., MCA, UGC NET Qualified)   8) Dr. Abdul Jabbar Khilji (Designation: Assistant Professor, Qualification: Ph.D., MCA, MTech.)   9) Mr. Pawan Kumar Tanwar (Designation: Assistant Professor, Qualification: Ph.D.*, MCA)   10) Mr. Surya Prakash (Designation: Assistant Professor, Qualification: MCA)  "],
         "context":[""]
        },
        {"tag": "bsc_faculty",
         "patterns": ["Give me information about faculty of BSc department","about faculty of MSc department","enlighten me about faculty of Bachelors of sciences department","how are teachers of masters of sciences department"],
         "responses": ["Faculties of Physics are:   1) Dr. Shivangi Bissa (Designation: HOD, Assistant Professor, Qualification: Ph.D.)   2) Dr.PreetiNaruka (Designation: Assistant Professor, Qualification: Ph.D., NET)   3) Dr. MS Shekhawat (Designation: Assistant Professor, Qualification: Ph.D., M.Sc.(Physics))   4) Pankaj Jain (Designation: Assistant Professor, Qualification: M.Sc., NET)   5) Ms. Deepshikha Yadav (Designation: Assistant Professor(Contract Basis), Qualification: M.Sc.)  Faculties of Chemistry are:   1) Dr. Praveen Purohit (Designation: Assistant Professor, Qualification: Ph.D., SLET, M.Sc.)   2) Dr. Chanchal Kacchawa (Designation: Assistant Professor, Qualification: M.Sc., M.Phil,(SLET), Ph.D.)   3) Dr.Mahendra Vyas (Designation: Assistant Professor, Qualification: Ph.D., M.Sc.)   5) Mrs. Garima Prajapat (Designation: Assistant Professor, Qualification: M.Sc., NET)   6) Dr. Suresh Purohit (Designation: Assistant Professor, Qualification: Ph.D., M.Sc.)  Faculties of Maths are:   1) Dr Amit Soni (Designation: Assistant Professor, Qualification: Ph.D., M.Sc.)   2) Dr. Radha Mathur (Designation: Head, Assistant Professor, Qualification: Ph.D., M.Phil, M.Sc.)   3) Dr. Manoj Soni (Designation: Assistant Professor, Qualification: Ph.D., M.Sc., JRF-NET, GATE)   4) Dr.Shokat Ali (Designation: Assistant Professor, Qualification: Ph.D., M.Sc.)   5) Mr. Vijay Kumar Makar (Designation: Assistant Professor, Qualification: M.Sc., NET, GATE, SET)   6) Mr. Prem Pratap Vyas(Designation: Assistant Professor, Qualification: M.Sc., M.Phill)  Faculties of English are:   1) Dr. Leela Vyas (Designation: HOD, Assistant Professor, Qualification: BSc, MA, Bed, PhD, Certification Course in French)   2) Dr. Atul Goswami (Designation: Assistant Professor, Qualification: MA, PGCTE, PhD)   3) Dr. Shradha Parmar (Designation: Assistant Professor, Qualification: M.A, PhD)   4) Dr.Manjeshwari Vyas (Designation: Assistant Professor, Qualification: MA, SLET, PhD)   5) Dr. Nisha Srivastava (Designation: Assistant Professor, Qualification: MA, PhD, BEd)   Dr. C.N. Shrimali (Designation: Assistant Professor, Qualification: MA, M.Phill, PhD)  "],
         "context":[""]
        },
        {"tag": "principal",
         "patterns": ["principal of college", "who is dean of college", "who is head of college","who is head of institution"],
         "responses": ["Principal of Engineering College bikaner is: Jaiprakash Bhamu(Ph.D from BITS, Pilani, M.Tech from MNIT, Jaipur)"],
         "context": [""]
        },
        {"tag": "hostel",
         "patterns": ["how is hostel facility","how many hostels are there","how many people share rooms in hostels","how are accomodation facilities for students"],
         "responses": ["Boys Hostel or Girls hostel?"],
         "context":[""]
        },
        {"tag": "girls_hostel",
         "patterns":["girls hostel","how many girls hostels are there","where is girls hostel","how many girls share rooms in hostel"],
         "responses":["There is one girls hostel of college which is located at a distance of 16kms from the college and the college provides free bus service for girls staying in the hostel. It has both double sharing rooms.The hostel also is wifi enabled. the total capacity of the hostel is 190 girls."],
         "context":[""]
        },
        {"tag": "boys_hostel",
         "patterns": ["how many boys hostels are there","are there separate hostel for 1st year boys","where is boys hostel","how many boys share rooms in hostel"],
         "responses": ["There are total 5 boys hostels out of which 4 are in college campus. there are 2 separate hostels only for 1st year students. The hostel rooms have LAN for internet and also have wifi for all floors.the 1st year hostel has a capacity of 250 boys. The other 2 campus hostels also have a capacity of 250. Mess facility is also available in hostels"],
         "context": [""]
        },
        {"tag": "clg_location",
         "patterns": ["where is college", "how far is campus from railway station","where is college located","what is location of college"],
         "responses": ["The college campus is located in Karni industrial area,Bikaner. The campus spreads across 338 bighas of land and is about 8kms from Bikaner junction railway station."],
         "context": [""]
        },
        {"tag": "sports",
         "patterns": ["how are sports facilities in college","how are sports teams of college","are there sports grounds in college","is there basketball court in college"],
         "responses": ["There is an active Institute Sports Council which looks after sports affairs of the college. The council sends contingent from college to atleast 2 sports fests organized by IITs,NITs etc for exposure of college teams on college fund. If the teams want to go to other fests on self fund then they are also given permissions provided no major tests or practicals of students are hindered. The council also conducts and annual Inter Branch Sports tournament named AAHVAAN in the month of march every year. There are no facility of coaches but seniors of all sports teams are very cooperative and helpfull to the juniors and the collee believes in the fact that mind and body both should be fit for an individual"],
         "context": [""]
        },
        {"tag": "extra_curr",
         "patterns": ["are fests held in college", "are there singing and dancing club in college","what are extracurricular activities held in college", "is there photography club in college"],
         "responses": ["There is a Student Activity Center in college which looks after organization of various extra curriculara and co_currucilar activities in college. The college has a Photography and Videography clum named MOSAIC and an English Literary club named WORDSMITHS. Also various cultural and technical fests are held in college . these clubs also organize various debates, photo walks, group discussions,ets"],
         "context": [""]
        },
        {"tag": "about_college",
         "patterns": ["information about college","which university is college affiliated to","about college"],
         "responses": ["Engineering College Bikaner, established in 1999 is one of the renowned institutions in the field of Engineering and Management. Approximately 3500 students are presently studying in the college. College possesses 337 bighas of land on which construction work has been accomplished on 6 lac square feet. The college is running the courses like B. Tech,M.Tech, MBA, MCA, M. Sc. (CS), BBA, BCA and PhD.Result oriented committed Faculty Members, Excellent Placement, Centre for Ethics and Indian Management, magnificent computer laboratories, gymnasium, cafeteria etc are salient features of this college. College is running an NABL accredited Ceramic, Electrical Research Laboratories in campus.Faculty members of this esteemed institution are providing consultancy services to business houses. For overall academic development of faculty members, college has conducted many short term courses on current technical topics, Communication Skills and on entrepreneurship etc. The engineering courses provided in college are as per the curriculum of Bikaner Technical University while the applied science courses are affiliated to MGSU,Bikaner."],
         "context": [""]
        },
        {"tag": "contact",
         "patterns": ["how to contact college","contact information","email id of college","phone number of college","mobile number of college"],
         "responses":["KARNI INDUSTRIAL AREA,PUGAL ROAD BIKANER (RAJASTHAN) PIN CODE 334004. Contact # : +91-0151 2253404 FAX # : +91-0151 2252919 Email: principal@ecb.ac.in, gecb.principal@gmail.com Website: www.ecb.ac.in"],
         "context": [""] 
        }


   ]
}
